<h1 style="font-size:250%; font-family:cursive; "><b>Pandas Library for Machine Learning - Combining Dataframe- Detailed Video in my YouTube Channel</b><a id="0"></a></h1>


<a href="https://youtu.be/myFHNQJa0Wg"><h1 style="font-size:250%; font-family:cursive; color:#ff6666;"><b>Link to this Video Tutorial</b></h1></a>

In [1]:
import pandas as pd

In [2]:
#concat

df1 = pd.DataFrame({'Name':['Vicky', 'Bill'], 'Age':[12,44]})
df2 = pd.DataFrame({'Name':['Ajantha', 'Devi'], 'Age':[56,84]})

In [3]:
df1

    Name  Age
0  Vicky   12
1   Bill   44

In [4]:
df2

      Name  Age
0  Ajantha   56
1     Devi   84

In [5]:
# 1=> hor
# 0 => vert
pd.concat([df1, df2], axis = 1)

    Name  Age     Name  Age
0  Vicky   12  Ajantha   56
1   Bill   44     Devi   84

In [6]:
df3 = pd.concat([df1, df2], axis = 0)
df3

      Name  Age
0    Vicky   12
1     Bill   44
0  Ajantha   56
1     Devi   84

In [7]:
df4 = pd.DataFrame({'Name':['Steve', 'jobs'], 'Age':[34,74], 'Hobby':['swimming', 'Reading']})
df4

    Name  Age     Hobby
0  Steve   34  swimming
1   jobs   74   Reading

In [8]:
# ignore index, join=> outer, inner
pd.concat([df3, df4], join = 'outer', ignore_index = True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   44       NaN
2  Ajantha   56       NaN
3     Devi   84       NaN
4    Steve   34  swimming
5     jobs   74   Reading

In [9]:
pd.concat([df3, df4], join = 'inner', ignore_index = True)

      Name  Age
0    Vicky   12
1     Bill   44
2  Ajantha   56
3     Devi   84
4    Steve   34
5     jobs   74

In [10]:
# Merge

size = pd.DataFrame({'Colour':['Red', 'Blue', 'Green'], "size":['M', 'S', 'M']})
Gender = pd.DataFrame({'Colour':['Red', 'Blue', 'Yellow'], "gender":['Male', 'Female', 'Male']})

In [11]:
size

  Colour size
0    Red    M
1   Blue    S
2  Green    M

In [12]:
Gender

   Colour  gender
0     Red    Male
1    Blue  Female
2  Yellow    Male

In [13]:
pd.merge(size, Gender, how = 'outer')

   Colour size  gender
0     Red    M    Male
1    Blue    S  Female
2   Green    M     NaN
3  Yellow  NaN    Male

In [14]:
pd.merge(size, Gender, how = 'inner')

  Colour size  gender
0    Red    M    Male
1   Blue    S  Female

In [15]:
pd.merge(size, Gender, how = 'left')

  Colour size  gender
0    Red    M    Male
1   Blue    S  Female
2  Green    M     NaN

In [16]:
pd.merge(size, Gender, how = 'right')

   Colour size  gender
0     Red    M    Male
1    Blue    S  Female
2  Yellow  NaN    Male